-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: mysql
-- Generation Time: Aug 25, 2026 at 05:45 PM
-- Server version: 8.0.46
-- PHP Version: 8.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `12plus`
--
CREATE DATABASE IF NOT EXISTS `12plus` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci;
USE `12plus`;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int NOT NULL,
  `name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'ΑΡΧΗ ΕΙΝΑΙ Ο ΛΟΓΟΣ'),
(2, 'ΜΑΘΗΜΑΤΙΚΑ - ΠΛΗΡΟΦΟΡΙΚΗ - ΤΕΧΝΟΛΟΓΙΑ'),
(3, 'ΦΥΣΗ ΚΑΙ ΖΩΗ'),
(4, 'ΠΟΛΙΤΕΣ ΤΟΥ ΚΟΣΜΟΥ'),
(5, 'ΥΓΕΙΑ - ΑΘΛΗΤΙΣΜΟΣ - ΤΕΧΝΗ'),
(10, 'ΤΟΜΕΑΣ ΠΛΗΡΟΦΟΡΙΚΗΣ');

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `categoryId` int DEFAULT NULL,
  `subjectId` int DEFAULT NULL,
  `number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer1` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer2` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer3` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer4` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `correctAnswer` int NOT NULL,
  `createdAt` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updatedAt` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`categoryId`, `subjectId`, `number`, `title`, `answer1`, `answer2`, `answer3`, `answer4`, `correctAnswer`, `createdAt`, `updatedAt`) VALUES
(1, 1, 'ΑΡΧΑΙΑ-1', 'Οι αρχαίοι Έλληνες έγραφαν ... ', 'Μόνο με μικρά γράμματα', 'Μόνο με κεφαλαία γράμματα', 'Και με μικρά και με κεφαλαία γράμματα', 'Με σύμβολα', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-10', 'Εκτός από τον ενικό και τον πληθυντικό αριθμό υπάρχει στα αρχαία Ελληνικά  και ο ...', 'Ρητός αριθμός', 'Δυϊκός αριθμός', 'Δεκαδικός αριθμός', 'Άρρητος αριθμός', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-11', 'Τι σημαίνει «εἰμί»;', 'Εγώ', 'Εσύ', 'Είμαι', 'Είσαι', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-12', 'Τι χρόνος είναι ο τύπος «λέλυκας»; ', 'Παρατατικός', 'Μέλλοντας', 'Αόριστος', 'Παρακείμενος', 4, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-13', 'Τι χρόνος είναι ο τύπος «τάξω»;', 'Ενεστώτας', 'Παρατατικός', 'Μέλλοντας', 'Αόριστος', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-14', 'Τι χρόνος είναι ο τύπος «ἐπαιδευσάμην»; ', 'Ενεστώτας', 'Παρατατικός', 'Αόριστος', 'Παρακείμενος', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-15', 'Το γ΄ ενικό του ρήματος «βλάπτω» στον αόριστο είναι: ', 'ἔβλαπτε', 'βλάψει', 'ἔβλαψε', 'βέβλαφε', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-16', 'Πώς μεταφράζεται το ειδικό απαρέμφατο;', 'να', 'ότι', 'για να', 'ώστε', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-17', 'Πώς μεταφράζεται  το τελικό απαρέμφατο;', 'να', 'ότι', 'για να', 'ώστε', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-18', 'Ποιος είναι ο ενεστώτας  του ρήματος «γράφω» στην προστακτική στο β΄ ενικό πρόσωπο; ', 'γράψον', 'γράφω', 'γράφε', 'γράψειν', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-19', 'Πώς σχηματίζεται η μετοχή παρακειμένου μέσης φωνής στο ρήμα «ταράττω»;  ', 'ταραττόμενος', 'ταραξόμενος', 'τεταραγμένος', 'τεταραχώς', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-2', 'Τι είναι η ψιλή; ', 'Πνεύμα', 'Τόνος', 'Σημείο στίξης', 'Υπογεγραμμένη', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-20', 'Πώς μεταφράζεται η αιτιολογική  μετοχή;  ', 'Επειδή', 'Όταν', 'Για να', 'Αν', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-21', 'Σε ποιο χρόνο είναι πάντα η τελική μετοχή;   ', 'Σε ενεστώτα', 'Σε μέλλοντα', 'Σε αόριστο', 'Σε παρακείμενο', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-22', 'Πώς σχηματίζεται η ονομαστική  πληθυντικού του ουσιαστικού «πατρίς»;   ', 'πατρίδαι', 'πατρίδες', 'πατρίσι', 'πατρίδα', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-23', 'Τι σημαίνει εχέμυθος; ', 'Αυτός που ξέρει καλά μυθολογία', 'Αυτός που λέει ωραία παραμύθια', 'Αυτός που κρατά μυστικά', 'Αυτός που έχει παραμύθια', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-24', 'Ποιο ΔΕΝ  είναι παράγωγο  του ρήματος «πείθω» από τα παρακάτω;   ', 'Πίστωση', 'Αξιόπιστος', 'Παράλογος', 'Πείσμα', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-25', 'Πώς  γράφεται η ονομαστική πληθυντικού του ουσιαστικού «στέλεχος»;  ', 'Στελέχοι με οι', 'Στελέχη με η', 'Στελέχει με ει', 'Στελέχι με ι', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-26', 'Πώς σχηματίζεται η ονομαστική πληθυντικού στο αρσενικό το επίθετο «ἀγενής»; ', 'ἀγενοῦς', 'ἀγενῆ', 'ἀγενεῖς', 'ἀγενῶν', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-27', 'Είναι ρήμα στα Νέα Ελληνικά και απαρέμφατο στα Αρχαία. Ποιο είναι; ', 'εἶμαι', 'εἶσαι', 'εἶναι', 'ἐστί', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-28', 'Το απαρέμφατο αορίστου του ρήματος «γράφω» είναι:  ', 'γράφειν', 'γράψειν', 'γράψαι', 'γράψας', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-29', '«Οἱ Ἀθηναῖοι ἦσαν ἀνδρεῖοι». Τι είναι συντακτικά η λέξη «ἀνδρεῖοι»; ', 'Υποκείμενο', 'Αντικείμενο', 'Κατηγορούμενο', 'Προσδιορισμός', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-3', 'Τι είναι η υπογεγραμμένη;', 'Πνεύμα', 'Τόνος', 'Σημείο στίξης', 'Ένα γιώτα (ι)', 4, '2026-08-23 18:11:24', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-30', 'Η μετοχή ενεργητικού παρακειμένου του ρήματος «λύω» στο αρσενικό γένος είναι: ', 'λελυκώς', 'λελυμένος', 'λελυκέναι', 'λυθείς', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-31', 'Ποιο είναι το γ΄ πληθυντικό πρόσωπο παρατατικού του ρήματος «λέγω»; ', 'ἔλεγαν', 'ἔλεγον', 'λέγουσι', 'ἔλεξαν', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-32', 'Το γ΄ ενικό πρόσωπο υποτακτικής παθητικού αορίστου του ρήματος «κινδυνεύω»  είναι:  ', 'κινδυνευθῇ', 'ἐκινδυνεύθη', 'ἐκινδυνεύσατο', 'κινδυνευσάμενος', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-33', 'Το απαρέμφατο ενεργητικού αορίστου β΄ του ρήματος «βάλλω» είναι: ', 'βάλειν', 'βαλεῖν', 'βαλέσθαι', 'βαλόμενος', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-34', 'Το β΄ενικό πρόσωπο της οριστικής αορίστου β΄ του ρήματος «μανθάνω» είναι:  ', 'ἔμαθε', 'μάθεις', 'ἔμαθες', 'μάθε', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-35', 'Το β΄ ενικό πρόσωπο της προστακτικής ενεργητικού αορίστου β΄ του ρήματος «λαμβάνω» είναι:   ', 'λαβέ', 'λάβε', 'λαβεῖν', 'λαβέτω', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-36', ' «Ὑπό Ξέρξου κήρυκες ἐπέμφθησαν». Να αναγνωρίσετε συντακτικά το « Ὑπό Ξέρξου».  ', 'Υποκείμενο', 'Αντικείμενο', 'Κατηγορούμενο', 'Ποιητικό αίτιο', 4, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-37', '«Οἱ Ἀθηναῖοι ἔφυγον, διότι ἐς χεῖρας ἦλθον». Η  δευτερεύουσα πρόταση «διότι ἐς χεῖρας ἦλθον» είναι:   ', 'Αιτιολογική', 'Ενδοιαστική', 'Χρονική', 'Τελική', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-38', '«Λέγει ὁ κατήγορος ὡς ὑβριστής εἰμί». Να αναγνωρίσετε τον συντακτικό ρόλο της δευτερεύουσας πρότασης «ὡς ὑβριστής εἰμί». ', 'Υποκείμενο στο «λέγει»', 'Αντικείμενο στο «λέγει»', 'Κατηγορούμενο στο «κατήγορος»', 'Επεξήγηση στο «κατήγορος»', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-39', '«Κερκυραῖοι ἐφοβήθησαν μή αἱ νῆες πολέμιαι ὦσι». Τι φοβήθηκαν οι Κερκυραίοι;  ', 'Μήπως τα πλοία ήταν εχθρικά', 'Μήπως ήρθαν οι εχθροί', 'Μήπως έφυγαν οι εχθροί με τα πλοία τους', 'Μήπως τα πλοία καταστράφηκαν', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-4', 'Στην κλητική του άρθρου σε όλα τα γένη ενικού και  πληθυντικού μπαίνει ο τύπος … ', 'τοῦ', 'τῷ', 'τόν', 'ὦ', 4, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-40', '«Τῆς ἀρετῆς  χρὴ τοὺς νέους ὀρέγεσθαι». Σύμφωνα με την απόδοση της πρότασης αυτής στα Νέα Ελληνικά, οι νέοι πρέπει να: ', 'Επιθυμούν την αρετή', 'Μισούν  την αρετή', 'Αντιπαθούν την αρετή', 'Απομακρύνονται από την αρετή', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-41', 'Ποιον τύπο χρησιμοποιούμε, όταν θέλουμε να προσφωνήσουμε κάποιον ιερέα;', 'πατήρ', 'πατρός', 'πατρί', 'πάτερ', 4, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-5', 'Η δοτική ενικού της προσωπικής αντωνυμίας στο α΄ πρόσωπο είναι:', 'ἐμοί', 'ὑμῖν', 'σοί', 'ὑμεῖς', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-6', ' Ο τύπος  «ὑμεῖς» σημαίνει: ', 'Εμάς', 'Εσείς', 'Αυτοί', 'Αυτές', 2, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-7', 'Τι σημαίνει ο τύπος «αὕτη»;', 'Εκείνη', 'Κάποια', 'Αυτή', 'Η ίδια', 3, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-8', 'Τι σημαίνει η φράση «Πύξ Λάξ»;  ', 'Με μπουνιές και κλοτσιές', 'Εναλλάξ', 'Αντίστροφα', 'Ανάποδα', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 1, 'ΑΡΧΑΙΑ-9', 'Τι σημαίνει η φράση «από μηχανής Θεός»; ', 'Αυτός που εμφανίζεται σε μια δύσκολη στιγμή και δίνει λύση στο πρόβλημα', 'Αυτός που ασχολείται με τις μηχανές', 'Ο Θεός που κάνει μηχανορραφίες', 'Ο Θεός που κατασκευάζει μηχανές', 1, '2026-08-23 18:09:59', '2026-08-23 18:12:28'),
(1, 2, 'ΓΛΩΣΣΑ-1', 'Ποιο από τα παρακάτω δομικά μέρη της παραγράφου είναι προαιρετικό;   ', 'Η θεματική πρόταση', 'Οι λεπτομέρειες-σχόλια', 'Η κατακλείδα', 'Κανένα από τα παραπάνω', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-10', 'Ποια χρονική βαθμίδα δηλώνει κάτι που γίνεται τώρα;', 'Το μέλλον', 'Το παρόν', 'Το παρελθόν', 'Η αρχική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-11', '«Ο υπολογιστής μου χάλασε». Η μορφή του υποκειμένου του ρήματος της πρότασης είναι:  ', 'Επίθετο', 'Ουσιαστικό', 'Αντωνυμία', 'Πρόταση', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-12', 'Το δεύτερο συνθετικό της λέξης «καλόκαρδος» είναι: ', 'Επίθετο', 'Επίρρημα', 'Ουσιαστικό', 'Αντωνυμία', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-13', '«Ο καθηγητής διδάσκει τους μαθητές μαθηματικά». Το ρήμα «διδάσκει» είναι:  ', 'Αμετάβατο', 'Μεταβατικό μονόπτωτο', 'Μεταβατικό δίπτωτο', 'Συνδετικό', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-14', 'Τι μέρη του λόγου είναι τα συνθετικά της λέξης «ασπρόμαυρος»;  ', 'επίθετο-επίθετο', 'επίθετο-ουσιαστικό', 'ουσιαστικό-επίθετο', 'επίθετο-επίρρημα', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-15', '«Η καθηγήτριά μας ντύνεται ωραία κάθε μέρα». Η διάθεση του ρήματος «ντύνεται» είναι:  ', 'Ενεργητική', 'Μέση', 'Παθητική', 'Προκλητική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-16', 'Ποιο από τα παρακάτω ΔΕΝ είναι τρόπος ανάπτυξης παραγράφου; ', 'Η αιτιολόγηση', 'Η διαίρεση', 'Η κατακλείδα', 'Ο ορισμός', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-17', '«Ανησυχούσε μήπως κάνει κάποιο λάθος στο διαγώνισμα». Η δευτερεύουσα πρόταση «μήπως κάνει κάποιο λάθος στο διαγώνισμα»  συντακτικά λειτουργεί ως: ', 'Υποκείμενο', 'Αντικείμενο', 'Επεξήγηση', 'Προσδιορισμός', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-18', '«Δείξε μου το φίλο σου, να σου πω ποιος είσαι». Ποιο είναι το είδος της δευτερεύουσας πρότασης «να σου πω ποιος είσαι»;  ', 'Βουλητική', 'Τελική', 'Συμπερασματική', 'Ειδική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-19', '«Είμαι βέβαιος ότι θα τα καταφέρεις». Ποιο είναι το είδος της δευτερεύουσας  πρότασης «ότι θα τα καταφέρεις»;  ', 'Βουλητική', 'Ειδική', 'Τελική', 'Αποτελεσματική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-2', 'Στη συνεκφορά «τα παιδικά χρόνια» τι είναι συντακτικά η λέξη «παιδικά»; ', 'Υποκείμενο', 'Αντικείμενο', 'Κατηγορούμενο', 'Επιθετικός προσδιορισμός', 4, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-20', '«Πριν με ακούσει, θύμωσε». Ποιο είναι το είδος της δευτερεύουσας πρότασης «πριν με ακούσει»;  ', 'Αιτιολογική', 'Χρονική', 'Υποθετική', 'Ειδική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-21', 'Αντώνυμο της λέξης «προτέρημα» είναι: ', 'Μειονέκτημα', 'Προσόν', 'Διχόνοια', 'Πλεονέκτημα', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-22', 'Αντώνυμο της λέξης «έσχατος» είναι:  ', 'Αρχικός', 'Μεσαίος', 'Τελευταίος', 'Τελικός', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-23', 'Συνώνυμο της λέξης «συναγωνισμός» είναι:   ', 'Άμιλλα', 'Έριδα', 'Ανταγωνισμός', 'Διαγωνισμός', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-24', 'Αντώνυμο της λέξης «συγκατάθεση» είναι: ', 'Άρνηση', 'Αποδοχή', 'Συμφωνία', 'Βεβαίωση', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-25', 'Αντώνυμο της λέξης «πρόσκαιρος» είναι:     ', 'Παροδικός', 'Μόνιμος', 'Ευμετάβολος', 'Επιφανής', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-26', '«Ούτε τον είδα ούτε τον άκουσα». Η σύνδεση των προτάσεων είναι: ', 'Υποτακτική', 'Παρατακτική', 'Ασύνδετο σχήμα', 'Τίποτα από τα παραπάνω', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-27', '«Φοβόταν αυτό, μήπως αποτύχει». Πώς λειτουργεί συντακτικά η δευτερεύουσα πρόταση; ', 'Ως υποκείμενο στο ρήμα «φοβόταν»', 'Ως επεξήγηση στο «αυτό»', 'Ως αντικείμενο στο ρήμα «φοβόταν»', 'Ως επιρρηματικός προσδιορισμός', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-28', '«Ρώτησα τη Μαρία εάν θα έρθει». Πώς μετατρέπεται ο πλάγιος λόγος σε ευθύ; ', '«Θα έρθεις»; Ρώτησα τη Μαρία', '«Θα έρθεις»; Ρώτησε τη Μαρία', '«Θα έρθεις»; Ρώτησε η Μαρία', 'Τίποτα από τα παραπάνω', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-29', '«Στις ορεινές περιοχές ο χειμώνας είναι βαρύς». Η πρόταση είναι: ', 'Κυριολεκτική', 'Μεταφορική', 'Δηλωτική', 'Επεξηγηματική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-3', 'Με ποια πτώση απευθύνουμε παράκληση ή προσφώνηση σε κάποιον; ', 'Την ονομαστική', 'Τη γενική', 'Την αιτιατική', 'Την κλητική', 4, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-30', '«Αν είχα ελεύθερο χρόνο, θα διάβαζα περισσότερο». Η απόδοση είναι: ', 'Αν είχα ελεύθερο χρόνο', 'Αν είχα', 'Θα διάβαζα περισσότερο', 'Θα διάβαζα', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-31', '«Αν και διάβασε πολύ, δεν έγραψε καλά». Η δευτερεύουσα πρόταση «αν και διάβασε πολύ» είναι: ', 'Εναντιωματική', 'Υποθετική', 'Βουλητική', 'Χρονική', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-32', 'Παράγωγο της λέξης «μαθητής» είναι:', 'Μαθησιακός', 'Μάθηση', 'Μαθητεία', 'Όλα τα παραπάνω', 4, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-33', 'Παράγωγο της λέξης «σχολείο» είναι:', 'Σχολικό', 'Σχολάω', 'Σχολή', 'Όλα τα παραπάνω', 4, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-4', 'Τι χρόνος είναι το «θα απευθυνθείτε»;', 'Εξακολουθητικός μέλλοντας', 'Στιγμιαίος μέλλοντας', 'Συντελεσμένος μέλλοντας', 'Ενεστώτας', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-5', '«Το παιδί φαίνεται χαρούμενο». Το ρήμα εδώ είναι ...', 'Μεταβατικό', 'Αμετάβατο', 'Συνδετικό', 'Συνθετικό', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-6', '«Δημιουργήθηκε μεγάλο πρόβλημα με την ισχυρή βροχόπτωση». Η φωνή του  ρήματος  «Δημιουργήθηκε»  είναι:  ', 'Ενεργητική', 'Παθητική', 'Μέση', 'Δημιουργική', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-7', 'Το πρώτο συνθετικό της λέξης «ανοιγοκλείνω» είναι:  ', 'Ρήμα', 'Ουσιαστικό', 'Επίρρημα', 'Επίθετο', 1, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-8', 'Η λέξη «καλύτερος» είναι:  ', 'Θετικός βαθμός του επιθέτου καλός', 'Συγκριτικός βαθμός του επιθέτου καλός', 'Υπερθετικός βαθμός του επιθέτου καλός', 'Τίποτα από τα παραπάνω', 2, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(1, 2, 'ΓΛΩΣΣΑ-9', 'Τι είδους προσδιορισμός είναι η λέξη «ώρες» στην πρόταση: «Ώρες καθόμουν και κοίταζα τη θάλασσα»;', 'Ετερόπτωτος', 'Ομοιόπτωτος', 'Επιρρηματικός', 'Ονοματικός', 3, '2026-08-23 18:31:39', '2026-08-23 18:31:39'),
(10, 101, 'ΔΙΚΤΥΑ-1', 'Τι είναι το LAN ', 'Ασύρματο Δίκτυο', 'Ταυτότητα Δικτύου', 'Τοπικό Δίκτυο', 'Δίκτυο Ευρείας Περιοχής ', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-10', 'Το πακέτο πληροφοριών που σχηματίζεται στο επίπεδο ζεύξης της αρχιτεκτονικής του διαδικτύου ονομάζεται:', 'Πακέτο', 'Πλαίσιο', 'Τμήμα', 'Μήνυμα', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-11', 'Ένα πρωτόκολλο επιπέδου μεταφοράς παίρνει ένα πακέτο πληροφοριών από το επίπεδο εφαρμογής και το ενθυλακώνει σε ένα:', 'Δεδομενογράφημα', 'Τμήμα', 'Πλαίσιο', 'Μήνυμα', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-12', ' Ποια διεύθυνση προσδιορίζει τις διευθύνσεις δικτύου και υπολογιστή;', 'Η διεύθυνση IP', 'Η διεύθυνση TCP', 'Η μάσκα υποδικτύου', 'Η διεύθυνση θύρας', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-13', 'To IP πρωτόκολλο προσφέρει:', 'λογική επικοινωνία μεταξύ υπολογιστών', 'λογική επικοινωνία μεταξύ διεργασιών', 'εγγυήσεις ως προς την καθυστέρηση.', 'εγγυήσεις ως προς το εύρος ζώνης', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-14', 'Η σειριακή μετάδοση:', 'χρησιμοποιεί ένα κανάλι μεταφοράς δεδομένων', 'είναι πιο ακριβή υλοποίηση από τη παράλληλη', 'στέλνει ταυτόχρονα bits', 'κάνει χρήση πολλών καναλιών ταυτόχρονα', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-15', 'Το πρωτόκολλο DHCP δίνει στο χρήστη-πελάτη υπηρεσία:', 'Για μια συγκεκριμένη χρονική περίοδο', 'Χωρίς χρονικά περιθώρια', 'Που δεν λαμβάνει υπόψη της τον χρόνο', 'Κανένα από τα παραπάνω', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-16', 'Ο τεμαχισμός ενός μεγάλου μηνύματος σε μικρότερα πακέτα', 'Μειώνει την πολυπλοκότητα', 'Αυξάνει τον συνολικό αριθμό των bits που πρέπει να μεταδοθούν', 'Διευκολύνει την δρομολόγηση του μηνύματος', 'Αυξάνει την καθυστέρηση αλλά μειώνει τον ρυθμό λαθών', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-17', 'Ποια είναι η ισοδύναμη δυαδική μορφή της δικτυακής διεύθυνσης 193.32.216.9;', '11000001 00101000 11011000 00001001', '11000001 00100000 11011000 00001001', '11010001 00100000 11011000 00001001', '11000001 00100000 11011000 00001000', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-18', 'To TCP/IP εγγυάται ότι τα πακέτα …', 'Μεταφέρονται γρήγορα', 'Δε χάνονται ', 'Κρυπτογραφούνται', 'Παραλαμβάνονται στη σωστή σειρά', 4, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-19', 'Tι σημαίνουν τα αρχικά ISP;', 'Internet Service Protocol', 'Interconnection Service Provider', 'Internet Service Provider', 'Internet Service Point', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-2', 'Τι είναι το WAN ', 'Δίκτυο Ευρείας Περιοχής ', 'Τοπικό Δίκτυο', 'Ασφαλές Δίκτυο', 'Κωδικός Ασύρματου Δικτύου', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-20', 'Ποιο από τα παρακάτω χρησιμοποιείται για τη μεταφορά μηνυμάτων στο διαδίκτυο;', 'HTTP', 'POP3', 'FTP', 'SMTP', 4, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-21', 'Ποιο από τα παρακάτω είναι πιο πιθανό να έχει στατική IP;', 'Ένας φορητός υπολογιστής', 'Ένας διακομιστής (server)', 'Ένα smartphone', 'Κανένα από τα παραπάνω', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-22', 'Ποιο από τα τα παρακάτω ΔΕΝ αποτελεί δίκτυο επικοινωνιών;', 'LAN', 'WAN', 'TAN', 'WMAN', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-23', 'Tι είναι το TCP/IP;', 'Πρωτόκολλο Επικοινωνίας Τοπικών Δικτύων', 'Μορφή πακέτων μετάδοσης', 'Συλλογή πρωτοκόλλων επικοινωνίας του διαδικτύου', 'Σταθμοί μετάδοσης δεδομένων', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-24', 'Ποιο πρωτόκολλο χρησιμοποιείται για τη μετάδοση ιστοσελίδων στο internet;', 'HTTP', 'DNS', 'Telnet', 'SSH', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-25', 'Τα βασικά συστατικά ενός δικτύου είναι …', 'Το φάσμα συχνοτήτων', 'Οι κεραίες μετάδοσης', 'Οι κόμβοι και οι συνδέσεις', 'Τα πακέτα των δεδομένων', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-26', '\'Ενας διακομιστής είναι …', 'Κεντρικός κόμβος στο δίκτυο που μεταβιβάζει πακέτα', 'Τερματικός σταθμός', 'Τερματικός Σταθμός με ασύρματη σύνδεση', 'Κανένα από τα παραπάνω', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-27', 'Ποιοι υπολογιστές έχουν IP address;', 'Υπολογιστές που έχουν Λειτουργικό Σύστημα Wundows', 'Υπολογιστές που έχουν Λειτουργικό Σύστημα iOS', 'Υπολογιστές που είναι συνδεδεμένοι σε ένα TCP/IP Δίκτυο', 'Όλοι οι παραπάνω αναφερθέντες', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-28', 'Η IP διεύθυνση είναι …', 'Μια διεύθυνση της μορφής www.address.com', 'Η διεύθυνση του κεντρικού εξυπηρετητή του Internet', 'Ένας μοναδικός αροθμός που χρησιμοποιούν συσκευές στο δίκτυο', 'Κανένα από τα παραπάνω', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-29', 'To πρωτόκολλο SSL κάνει …', 'Έλεγχο λαθών στα δεδομένα που μεταφέρονται στο Internet', 'Περιορίζει την απώλεια πακέτων που μεταφέρονται στο Internet', 'Έλεγχο ροής στη μεταφορά δεδομένων στο Internet', 'Κρυπτογράφηση των δεδομένων που μεταφέρονται στο Internet', 4, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-3', 'Σε μια 10Kbps Ethernet ζεύξη, αν το μήκος των πακέτων είναι 32bits, η καθυστέρηση μετάδοσης σε milliseconds είναι', '3.2', '32', '0.32', 'Κανένα από τα παραπάνω', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-30', 'Τι ΔΕΝ υπάρχει μέσα σε ένα πακέτο Ethernet;', 'Διεύθυνση Αποστολέα', 'Χαιρετιστήριο', 'Διεύθυνση παραλήπτη', 'Δεδομένα Πακέτου', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-31', 'Ποιος μας δίνει τη διεύθυνση IP;', 'Ο router', 'Ο κατασκευαστής', 'Ο πάροχος Internet ή ο διαχειριστής του δικτύου', 'Κανένα από τα παραπάνω', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-32', 'Η κρυπτογράφηση δεδομένων είναι …', 'Η μετατροπή δεδομένων για να μη μπορούν να αναγνωστούν', 'Ό έλεγχος λαθών στα δεδομένα', 'Η μεταφορά δεδομένω χωρίς απώλειες', 'Κανένα από τα παραπάνω', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-33', 'Τι είναι το Ίντερνετ των αντκειμένων (Internet-of-Things ΙοΤ);', 'Η διασύνδεση ηλεκτρικών συσκευών στο διαδίκτυο', 'Η σύνδεση συσκευών ασύρματα', 'Η διασύνδεση συακευών μέσω δορυφόρου', 'Κανένα από τα παραπάνω', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-34', 'Ποια έκδοση του πρωτοκόλλου IP χρησιμοποιείται τώρα;', 'IPv2', 'IPv3', 'IPv4', 'IPv6', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-35', 'Ποιος εφηύρε το WWW;', 'Η Google', 'Ο Ted Nelson', 'O Tim Berners-Lee', 'O Douglas Carl Engelbart', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-36', 'Ποιο πρωτόκολλο χρησιμοποιείται για τη μεταφορά αρχείων στο internet;', 'Telnet', 'SSH', 'FTP', 'DHCP', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-37', 'O ρυθμός μετάδοσης ψηφιακών σημάτων μετριέται σε …', 'Bytes per second ', 'Hertz', 'Bits per second ', 'Volts', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-38', 'Τι είναι η κυβερνοασφάλεια;', 'Η δημιουργία ιστοσελίδων', 'Η προστασία από ψηφιακές απειλές', 'Η χρήση κοινωνικών δικτύων', 'Το ηλεκτρονικό ταχυδρομείο', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-39', 'Ποιο από τα παρακάτω είναι πρόγραμμα προστασίας;', 'Ransomware', 'Trojan', 'Antivirus', 'Excel', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-4', 'Σε ποια τεχνολογία οι πόροι δεσμεύονται κατά απαίτηση', 'Στη μεταγωγή πακέτων', 'Στη μεταγωγή κυκλώματος', 'Στη μεταγωγή γραμμής', 'Σε καμία από τις παραπάνω', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-40', 'Τι κάνει ένα Phishing μήνυμα;', 'Σου στέλνει δώρα', 'Ζητά κωδικούς με ύπουλο τρόπο', 'Ενημερώνει το σύστημά σου', 'Καθαρίζει τον υπολογιστή σου', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-41', 'Ποια ένδειξη δείχνει ασφαλή σύνδεση;', 'http://', 'https://', 'www', 'ftp://', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-42', 'Τι είναι η συμμετρική κρυπτογράφηση;', 'Χρήση δύο διαφορετικών κωδικών', 'Χρήση ίδιου κωδικού και στις δύο πλευρές', 'Κωδικός μόνο για ανάγνωση', 'Κρυφό μήνυμα χωρίς κλειδί', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-43', 'Πώς ονομάζεται ο κακόβουλος κώδικας που φαίνεται ακίνδυνος;', 'Trojan Horse', 'Worm', 'Firewall', 'Encryptor', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-44', 'Τι είναι τα Ψηφιακά Πιστοποιητικά;', 'Σχολικά έγγραφα', 'Πιστοποιούν ταυτότητα στο διαδίκτυο', 'Βεβαιώσεις μαθητών', 'Βραβεία πληροφορικής', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-45', 'Τι είναι το Ransomware;', 'Πρόγραμμα σχεδίασης', 'Πρόγραμμα ασφαλείας', 'Λογισμικό που ζητά λύτρα', 'Εφαρμογή κοινωνικής δικτύωσης', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-5', 'Η καθυστέρηση μετάδοσης εξαρτάται από:', 'Την ταχύτητα διάδοσης της ζεύξης', 'την απόσταση μεταξύ των 2 κόμβων', 'το μέγεθος του πακέτου (σε bits)', 'κανένα από τα παραπάνω', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-6', 'Στη μεταγωγή πακέτων έχουμε συμφόρηση όταν:', 'Κυκλοφορούν πολλά πακέτα.', 'Υπάρχει μεγάλη ζήτηση πόρων.', 'Τα πακέτα περιμένουν σε σειρά για να εξυπηρετηθούν.', 'Έχουμε χαμηλό ρυθμό μετάδοσης.', 3, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-7', 'Στο μοντέλο ομοτίμων τα τερματικά συστήματα είναι:', 'Με ξεχωριστούς ρόλους πελάτη-εξυπηρετητή', 'Ταυτόχρονα και πελάτες και εξυπηρετητές', 'Μόνο πελάτες', 'Μόνο εξυπηρετητές', 2, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-8', 'Η παράλληλη μετάδοση:', 'υλοποιείται πιο εύκολα από την σειριακή', 'χρησιμοποιεί ένα κανάλι μεταφοράς δεδομένων', 'κάνει διαδοχική μεταφορά δεδομένων', 'στέλνει ταυτόχρονα bits', 4, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(10, 101, 'ΔΙΚΤΥΑ-9', 'Ποιο από τα παρακάτω ΔΕΝ είναι επίπεδο του OSI;', 'Ελέγχου (Control)', 'Ζεύξης (Data Link)', 'Δικτύου (Network)', 'Μεταφοράς (Transport)', 1, '2026-08-23 18:33:28', '2026-08-23 18:33:28'),
(1, 8, 'ΕΛΕΝΗ-1', 'Γιατί βρίσκεται η Ελένη στην Αίγυπτο, σύμφωνα με την ομώνυμη τραγωδία του Ευριπίδη;   ', 'Για να μείνει  πιστή στον άνδρα της', 'Για να μην γίνει ο τρωικός πόλεμος', 'Γιατί ήθελε να παντρευτεί το Θεοκλύμενο', 'Γιατί ήταν μισητή στους Τρώες', 1, '2026-08-23 18:33:17', '2026-08-23 18:33:17'),
(1, 8, 'ΕΛΕΝΗ-2', 'Ποιος έγραψε την τραγωδία Ελένη;', 'Ο Αισχύλος', 'Ο Σοφοκλής', 'Ο  Ευριπίδης', 'Ο  Όμηρος', 3, '2026-08-23 18:33:17', '2026-08-23 18:33:17'),
(1, 8, 'ΕΛΕΝΗ-3', 'Ποια Ελένη ήταν στην Τροία;', 'Η αληθινή', 'Η ψεύτικη', 'Η αισιόδοξη', 'Η πολέμια', 2, '2026-08-23 18:33:17', '2026-08-23 18:33:17'),
(1, 8, 'ΕΛΕΝΗ-4', 'Τι μήνυμα θέλει να δώσει ο Ευριπίδης με το να επινοεί την ψεύτικη Ελένη στην ομώνυμη τραγωδία; ', 'Ο πόλεμος δεν έπρεπε να γίνει', 'Η Ελένη δεν ήταν ερωτευμένη με τον Πάρη', 'Η Ελένη έπρεπε να μείνει με το Μενέλαο', 'Τίποτα από τα παραπάνω', 1, '2026-08-23 18:33:17', '2026-08-23 18:33:17'),
(1, 8, 'ΕΛΕΝΗ-5', 'Ποιος  βοήθησε τον Μενέλαο και την Ελένη να δραπετεύσουν από την Αίγυπτο; ', 'Η Θεονόη', 'Ο Τεύκρος', 'Ο Θεοκλύμενος', 'Η θεά Αφροδίτη', 1, '2026-08-23 18:33:17', '2026-08-23 18:33:17'),
(1, 8, 'ΕΛΕΝΗ-6', 'Πώς ήταν ντυμένος ο Μενέλαος, όταν εμφανίστηκε στην Αίγυπτο;  ', 'Καλοντυμένος', 'Ως πολεμιστής', 'Με σκισμένα ρούχα λόγω της τρικυμίας', 'Ως δούλος, για να μην τον αναγνωρίσουν', 3, '2026-08-23 18:33:17', '2026-08-23 18:33:17'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-1', 'Πόσα βιβλία έχει η Παλαιά Διαθήκη; ', '27', '35', '49', '76', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-10', 'Ποιους Αγίους ονομάζουμε μάρτυρες; ', 'Αυτούς που ζούσαν στα μοναστήρια', 'Αυτούς που θανατώθηκαν, επειδή δεν αρνήθηκαν την πίστη τους', 'Αυτούς που κατέθεταν εναντίον των χριστιανών', 'Αυτούς που κατέθεταν υπέρ των χριστιανών', 2, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-11', 'Σύμφωνα με την Αγία Γραφή, την «έκτη ημέρα» ο Θεός δημιούργησε:', 'Το Φως', 'Το νερό', 'Τα φυτά', 'Τον άνθρωπο', 4, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-12', 'Σε πόσες περίπου διαφορετικές γλώσσες και διαλέκτους έχει μεταφραστεί η Αγία Γραφή; ', '500', '1.000', '2.000', '10.000', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-13', 'Πώς ονομάζεται η Σύνοδος στην οποία συμμετέχουν αντιπρόσωποι των χριστιανών όλου του κόσμου;', 'Τοπική', 'Επαρχιακή', 'Καθολική', 'Οικουμενική', 4, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-14', 'Πώς ονομάζονται οι αποφάσεις μιας εκκλησιαστικής Συνόδου που αφορούν θέματα της πίστης των χριστιανών;', 'Δόγματα', 'Κανόνες', 'Νόμοι', 'Ύμνοι', 1, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-15', 'Με ποιους κάνει ο Θεός συμφωνία στην Καινή Διαθήκη;', 'Μόνο με τους Ισραηλίτες', 'Μόνο με τους Έλληνες', 'Μόνο με τους Ισραηλίτες και τους Έλληνες', 'Με όλους τους ανθρώπους', 4, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-16', 'Ποιος αυτοκράτορας έλαβε τις αποφάσεις του Διατάγματος των Μεδιολάνων;', 'Ο Ιουστινιανός', 'Ο Θεοδόσιος', 'Ο Μέγας Αλέξανδρος', 'Ο Μέγας Κωνσταντίνος', 4, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-17', 'Σύμφωνα με την Αγία Γραφή, την «πρώτη ημέρα» ο Θεός δημιούργησε:', 'Το Φως', 'Το νερό', 'Τα φυτά', 'Τον άνθρωπο', 1, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-18', 'Τι σημαίνει ότι τα βιβλία της Αγίας Γραφής είναι Θεόπνευστα;', 'Τα έγραψε ο ίδιος ο Θεός', 'Τα έγραψαν μόνοι τους οι άνθρωποι', 'Συνεργάστηκαν ο Θεός και οι άνθρωποι', 'Τίποτα από τα παραπάνω', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-19', 'Ποιοι ήταν οι Πρωτόπλαστοι;', 'Ο Νώε και η Εύα', 'Ο Αβραάμ και η Σάρα', 'Ο Αδάμ και η Εύα', 'Ο Αδάμ και ο Αβραάμ', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-2', 'Πόσα βιβλία έχει η Καινή Διαθήκη; ', '27', '35', '49', '76', 1, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-20', 'Ποιος από τους παρακάτω ΔΕΝ είναι ένας από τους τρεις Ιεράρχες;', 'Ο Μέγας Βασίλειος', 'Ο Γρηγόριος Ναζιανζηνός', 'Ο Ιωάννης ο Θεολόγος', 'Ο Ιωάννης ο Χρυσόστομος', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-3', 'Ο σκοπός της Θεολογίας είναι να απαντήσει στο ερώτημα: ', 'Ποιος και γιατί δημιούργησε τον κόσμο', 'Ποιος και πότε δημιούργησε τον κόσμο', 'Πώς και πότε δημιουργήθηκε ο κόσμος', 'Πώς και γιατί δημιουργήθηκε ο κόσμος', 1, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-4', 'Στην Αγία Γραφή η λέξη «Διαθήκη» σημαίνει: ', 'Τη συμφωνία για τη μοιρασιά μιας περιουσίας', 'Τη συμφωνία του Θεού με τους ανθρώπους', 'Την τελευταία επιθυμία κάποιου ανθρώπου', 'Τη συμφωνία των ανθρώπων με άλλους ανθρώπους', 2, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-5', 'Τι πρόσφερε το Διάταγμα των Μεδιολάνων στη Ρωμαϊκή Αυτοκρατορία; ', 'Δημοκρατία', 'Ανεξιθρησκία', 'Χαμηλή φορολογία', 'Πολιτικό γάμο', 2, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-6', 'Η αίρεση του Νεστορίου (Νεστοριανισμός) ισχυρίζεται πως: ', 'Ο Χριστός είναι μόνο Θεός', 'Ο Χριστός είναι μόνο άνθρωπος', 'Ο Χριστός είναι και Θεός και άνθρωπος, που όμως ενώθηκαν μόνο εξωτερικά και όχι πραγματικά', 'Ο Χριστός δεν υπήρξε', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-7', 'Η αίρεση του Μονοφυσιτισμού ισχυρίζεται πως: ', 'Ο Χριστός είναι μόνο Θεός', 'Ο Χριστός είναι μόνο άνθρωπος', 'Ο Χριστός είναι Θεάνθρωπος', 'Ο Χριστός δεν υπήρξε', 1, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-8', 'Πόσα χρόνια κράτησαν οι μεγάλοι διωγμοί των χριστιανών; ', '5 χρόνια', '50 χρόνια', '250 χρόνια', '500 χρόνια', 3, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 4, 'ΘΡΗΣΚΕΥΤΙΚΑ-9', 'Η αίρεση του Αρείου (Αρειανισμός) ισχυρίζεται πως: ', 'Ο Χριστός είναι μόνο άνθρωπος', 'Ο Χριστός είναι μόνο Θεός', 'Ο Χριστός είναι Θεάνθρωπος', 'Ο Χριστός δεν υπήρξε', 1, '2026-08-23 18:32:22', '2026-08-23 18:32:22'),
(1, 7, 'ΙΛΙΑΔΑ-1', 'Ποιος ΔΕΝ είναι Έλληνας από τους παρακάτω;', 'Ο Αχιλλέας', 'Ο Πάτροκλος', 'Ο Αγαμέμνονας', 'Ο  Έκτορας', 4, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-10', 'Τι είναι η Ιλιάδα; ', 'Λογοτεχνία', 'Ιστορική πηγή', 'Έπος', 'Όλα τα παραπάνω', 4, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-11', 'Τι ήταν ο Κάλχας;  ', 'Βασιλιάς', 'Πολεμιστής', 'Μάντης', 'Κήρυκας', 3, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-12', 'Η Ιλιάδα τελειώνει με ...', 'Το Δούρειο Ίππο να μπαίνει στην Τροία', 'Το θάνατο του Αχιλλέα', 'Τον ενταφιασμό του Έκτορα', 'Το θάνατο του Αγαμέμνονα', 3, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-13', 'Ποιο νεκρό Τρώα δένει ο Αχιλλέας στο άρμα του και τον σέρνει στα χώματα; ', 'Τον Πάρη', 'Τον Έκτορα', 'Τον Πρίαμο', 'Τον Εύφορβο', 2, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-14', 'Ποια προσπάθησε να πείσει τον  Έκτορα  να μην πάει στη μάχη, για να μην σκοτωθεί; ', 'Η Εκάβη', 'Η Ελένη', 'Η Χρυσηίδα', 'Η Ανδρομάχη', 4, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-15', 'Ποιος Θεός έχει το χαρακτηριστικό επίθετο «Φοίβος»; ', 'Ο Δίας', 'Ο Απόλλωνας', 'Ο  Άρης', 'Ο Ερμής', 2, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-16', 'Ο Αχιλλέας μπαίνει ξανά στη μάχη, για να ... ', 'Εκδικηθεί τον Αγαμέμνονα', 'Εκδικηθεί το θάνατο του Πατρόκλου', 'Σκοτώσει τον Πρίαμο', 'Σκοτώσει τον  Πάρη', 2, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-17', 'Πότε έγινε ο Τρωικός πόλεμος;  ', 'Τον 12ο αι. π.Χ.', 'Τον  11ο αι.π.Χ.', 'Τον 10ο αι. π.Χ.', 'Τον 8ο αι. π.Χ.', 1, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-2', 'Ποιο είναι το πατρωνυμικό επίθετο του Αχιλλέα;', 'Ατρείδης', 'Τελαμώνιος', 'Εκτορίδης', 'Πηλείδης', 4, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-3', 'Ποια ήταν η γυναίκα του  Έκτορα;', 'Η Ελένη', 'Η Κλυταιμνήστρα', 'Η Εκάβη', 'Η Ανδρομάχη', 4, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-4', 'Ποιος ΔΕΝ είναι Τρώας από τους παρακάτω;', 'Ο  Έκτορας', 'Ο Πρίαμος', 'Ο  Διομήδης', 'Ο  Αινείας', 3, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-5', 'Η Χρυσηίδα ήταν ...  ', 'Αιχμάλωτη δούλα του Αχιλλέα', 'Αιχμάλωτη δούλα του Αγαμέμνονα', 'Αδελφή της Βρισηίδας', 'Όλα τα παραπάνω', 2, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-6', 'Ποιος θεός ή θεά από τους παρακάτω ήταν με το μέρος των Ελλήνων στον Τρωικό πόλεμο; ', 'Ο Άρης', 'Η Αφροδίτη', 'Η  Ήρα', 'Ο Απόλλωνας', 3, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-7', 'Η Οδύσσεια και η Ιλιάδα γράφονται τον 8ο αιώνα π.Χ., αλλά αναφέρονται στον …  ', '14ο αι. π.Χ.', '12ο αι.π.Χ.', '10ο αι. π.Χ.', '7ο αι. π.Χ.', 2, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-8', 'Ποιο είναι το θέμα της Ιλιάδας;', 'Ο τρωικός πόλεμος', 'Η προδοσία της ωραίας Ελένης', 'Η οργή του Αχιλλέα', 'Η ιστορία της πόλης της Τροίας', 3, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 7, 'ΙΛΙΑΔΑ-9', 'Ποιο είναι το περιεχόμενο της Ιλιάδας; ', 'Ο τρωικός πόλεμος', 'Η ζωή του Αχιλλέα', 'Η οργή του Αχιλλέα', 'Η ιστορία της πόλης της Τροίας', 1, '2026-08-23 18:33:03', '2026-08-23 18:33:03'),
(1, 5, 'ΙΣΤΟΡΙΑ-1', 'Ποιος ήταν ο Αθηναίος Στρατηγός στη μάχη του Μαραθώνα;', 'Ο Θεμιστοκλής', 'Ο Μιλτιάδης', 'Ο Λεωνίδας', 'Ο Παυσανίας', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-10', 'Πώς ονομάζονταν οι δούλοι στην αρχαία Σπάρτη; ', 'Περίοικοι', 'Είλωτες', 'Μέτοικοι', 'Σκλάβοι', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-11', 'Πώς ονομαζόταν η λαϊκή συνέλευση των Σπαρτιατών; ', 'Εκκλησία του Δήμου', 'Απέλλα', 'Γερουσία', 'Βουλή', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-12', 'Πώς ονομαζόταν η λαϊκή συνέλευση των Αθηναίων; ', 'Εκκλησία του Δήμου', 'Απέλλα', 'Γερουσία', 'Βουλή', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-13', 'Ποιοι νόμοι ήταν τόσο αυστηροί που έλεγαν ότι είναι «γραμμένοι με αίμα»; ', 'Οι νόμοι του Δράκοντα', 'Οι νόμοι του Σόλωνα', 'Οι νόμοι του Λυκούργου', 'Οι νόμοι του Κλεισθένη', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-14', 'Ποιος χώρισε τους πολίτες σε τάξεις ανάλογα με το εισόδημα και όχι την καταγωγή; ', 'Ο Περικλής', 'Ο Σόλωνας', 'Ο Κλεισθένης', 'Ο Λυκούργος', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-15', 'Ποιος θεωρείται ο θεμελιωτής του δημοκρατικού πολιτεύματος; ', 'Ο Περικλής', 'Ο Κλεισθένης', 'Ο Σόλωνας', 'Ο Φίλιππος', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-16', 'Τι είπε ο Λεωνίδας στον Ξέρξη στις Θερμοπύλες; ', 'Μολών λαβέ', 'Ή ταν ή επί τας', 'Εν τούτω Νίκα', 'Δόξα τω Θεώ', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-17', 'Πού έδωσε ο Μέγας Αλέξανδρος την πρώτη μάχη ενάντια στους Πέρσες; ', 'Στην Ισσό', 'Στον Υδάσπη ποταμό', 'Στο Γρανικό ποταμό', 'Στα Γαυγάμηλα', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-18', 'Στα χρόνια ποιου πολιτικού ηγέτη η Αθήνα έζησε το «χρυσό αιώνα» της; ', 'Του Επαμεινώνδα', 'Του Κλεισθένη', 'Του Μεγάλου Αλεξάνδρου', 'Του Περικλή', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-19', 'Ποιος αυτοκράτορας έδωσε το όνομά του σε πόλη;', 'Κωνσταντίνος Α΄ο Μέγας', 'Ιουστινιανός', 'Θεοδόσιος', 'Κωνσταντίνος ΙΑ΄ Παλαιολόγος', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-2', 'Ποιοι έγραφαν με Γραμμική Α΄; ', 'Οι Μινωίτες', 'Οι Κυκλαδίτες', 'Οι Μυκηναίοι', 'Οι Αθηναίοι', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-20', 'Πότε έγινε η μεταφορά της πρωτεύουσας της Ρωμαϊκής  αυτοκρατορίας από τη Ρώμη στην Κωνσταντινούπολη;', 'Το  320', 'Το  330', 'Το  340', 'Το  350', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-21', 'Η Βυζαντινή ιστορία τελειώνει με την άλωση της Κωνσταντινουπόλεως, που έγινε στις 29 Μαΐου του ...', '1353', '1435', '1453', '1543', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-22', 'Στα χρόνια ποιου αυτοκράτορα χτίστηκε η Αγία Σοφία;', 'Του Κωνσταντίνου Α΄ του Μέγα', 'Του Ιουστινιανού', 'Του Θεοδόσιου', 'Του Ηράκλειου', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-23', 'Ποιο σύστημα οργάνωσης κοινωνίας, οικονομίας και πολιτικής έχουμε στο μεσαιωνικό game of thrones;  ', 'Γεωργικό', 'Φεουδαρχικό', 'Προβιομηχανικό', 'Δουλοκτητικό', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-24', 'Πώς λέγονταν οι διοικητικές περιφέρειες με δικό τους στρατό που εμφανίζονται τον 7ο αιώνα στο Βυζάντιο;   ', 'Πρόνοιες', 'Θέματα', 'Τσιφλίκια', 'Επαρχίες', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-25', 'Στη διάρκεια ποιου κινήματος χρησιμοποιήθηκε η ανεικονική τεχνοτροπία στο διάκοσμο των Βυζαντινών εκκλησιών;', 'Της Αναγέννησης', 'Της Εικονολατρίας', 'Της Εικονομαχίας', 'Της θρησκευτικής μεταρρύθμισης', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-26', 'Ποιου αυτοκράτορα η νομοθεσία αποτέλεσε τη βάση του Δικαίου της νεότερης Ευρώπης;    ', 'Κωνσταντίνου Α΄', 'Ιουστινιανού', 'Θεοδόσιου', 'Λέοντος του Στ΄ του Σοφού', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-27', 'Πότε έγινε η Πρώτη Άλωση της Κωνσταντινούπολης;', 'Το 1054', 'Το 1204', 'Το 1211', 'Το 1453', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-28', 'Από ποιους έγινε η Άλωση της Κωνσταντινούπολης το 1204; ', 'Τους Οθωμανούς Τούρκους', 'Τους Σελτζούκους  Τούρκους', 'Τους Σταυροφόρους', 'Τους Άραβες', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-29', 'Ποιος ήταν ο νέος τύπος ανθρώπου που αναδύεται στην Αναγέννηση; ', 'Οικονομικός άνθρωπος', 'Οικουμενικός άνθρωπος', 'Αναγεννησιακός άνθρωπος', 'Κλασσικός άνθρωπος', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-3', 'Ποιος βρισκόταν στην κορυφή της Μυκηναϊκής κοινωνίας; ', 'Ο άναξ', 'Ο βασιλιάς', 'Το ιερατείο', 'Οι γραφείς', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-30', 'Ποιος ανακάλυψε την τυπογραφία το 15ο αι.; ', 'Ο Γκράχαμ Μπελ (Graham Bell)', 'Ο Έντισον (Thomas Edison)', 'Ο Βατ (James Watt)', 'Ο Γουτεμβέργιος (Johannes Gutenberg)', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-31', 'Ποιος ήταν ο πρώτος αυτοκράτορας του Βυζαντίου;', 'Κωνσταντίνος  Α΄ ο Μέγας', 'Ιουστινιανός', 'Θεοδόσιος', 'Κωνσταντίνος ΙΑ΄ ο Παλαιολόγος', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-32', 'Ποιος ήταν ο τελευταίος αυτοκράτορας του Βυζαντίου;', 'Κωνσταντίνος  Α΄ ο Μέγας', 'Ιουστινιανός', 'Θεοδόσιος', 'Κωνσταντίνος ΙΑ΄ ο Παλαιολόγος', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-33', 'Σε ποια περιοχή νόμιζε ότι βρισκόταν ο Χριστόφορος Κολόμβος, όταν  ανακάλυψε την Αμερική; ', 'Αραβία', 'Ινδίες', 'Κίνα', 'Μεξικό', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-34', 'Πώς λεγόταν η νέα τάξη που δημιουργήθηκε τον 9ο αι. από τους γάμους ανάμεσα στην αριστοκρατία της γης και την αριστοκρατία των αξιωμάτων; ', 'Ευγενείς', 'Δυνατοί', 'Προνοιάριοι', 'Πένητες', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-35', 'Πού μεταφέρθηκε η πρωτεύουσα της Βυζαντινής αυτοκρατορίας μετά την άλωση της Κωνσταντινούπολης το 1204;   ', 'Στη Ρώμη', 'Στη Μόσχα', 'Στη Νίκαια της Βιθυνίας', 'Στο Μυστρά', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-36', 'Ο Διαφωτισμός ήταν κίνημα που έγινε τον ...', '15ο αι.', '16ο αι.', '18ο αι.', '19ο αι.', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-37', 'Ποια είναι τα φυσικά δικαιώματα του ανθρώπου;  ', 'Ζωή και ιδιοκτησία', 'Ελευθερία σκέψης και έκφρασης', 'Ισότητα απέναντι στο νόμο', 'Όλα τα παραπάνω', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-38', 'Ποιος ήταν ο εκφραστής της ανεξιθρησκίας; ', 'Μοντεσκιέ', 'Βολτέρος', 'Ρουσό', 'Τζον Λοκ', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-39', 'Ποια ήταν η γυναίκα του Λουδοβίκου 16ου;', 'Μαρία Θηρεσία', 'Θηρεσία Αντουανέτα', 'Μαρία Αντουανέτα', 'Σαρλότ Αντουανέτα', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-4', 'Πώς ονομάζονταν τα τείχη των Μυκηναίων; ', 'Γιγάντια', 'Κυκλώπεια', 'Επάλξεις', 'Πύργοι', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-40', 'Ο Ροβεσπιέρος ήταν ... ', 'Βασιλιάς', 'Εκπρόσωπος της Τρίτης τάξης', 'Διαφωτιστής', 'Ιστορικός', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-41', 'Τι ήταν η Βαστίλη; ', 'Ανάκτορο του Λουδοβίκου', 'Φυλακή', 'Βουλή', 'Πόλη της Γαλλίας', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-42', 'Ο Ναπολέων κατέκτησε όλη την Ευρώπη εκτός από την ...  ', 'Πρωσία', 'Ρωσία', 'Γερμανία', 'Ιταλία', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-43', 'Οι κλέφτες κι οι αρματολοί ήταν ... ', 'Πολιτικοί', 'Φαναριώτες', 'Πολεμιστές', 'Διαφωτιστές', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-44', 'Τι ήταν ο Αδαμάντιος Κοραής; ', 'Πολιτικός', 'Στρατιωτικός', 'Διαφωτιστής', 'Πρωθυπουργός', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-45', 'Τι ήταν ο Αλέξανδρος Μαυροκορδάτος; ', 'Φαναριώτης', 'Πολιτικός', 'Πρόεδρος του Εκτελεστικού', 'Όλα τα παραπάνω', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-46', 'Πώς δούλευαν όσοι ανήκαν στη Φιλική Εταιρεία; ', 'Με μυστικότητα', 'Με κρυπτογραφικό αλφάβητο', 'Με ψευδώνυμα', 'Με όλα τα παραπάνω', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-47', 'Πότε ξεκίνησε η ελληνική επανάσταση; ', 'Απρίλιο του 1776', 'Ιανουάριο του 1821', 'Μάρτιο του 1821', 'Φεβρουάριο του 1825', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-48', 'Από πού ξεκίνησε η ελληνική επανάσταση του 1821; ', 'Μακεδονία', 'Πελοπόννησο', 'Στερεά Ελλάδα', 'Ήπειρο', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-49', 'Πότε έγινε ανεξάρτητο κράτος η Ελλάδα; ', '1821', '1829', '1830', '1835', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-5', 'Ποιοι ήταν οι κύριοι λόγοι του δεύτερου ελληνικού αποικισμού; ', 'Οικονομικοί και πολιτικοί', 'Κοινωνικοί', 'Θρησκευτικοί', 'Εξευρενητικοί', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-50', 'Ποιος ήταν ο πρώτος κυβερνήτης του ελεύθερου Ελληνικού κράτους; ', 'Πετρόμπεης Μαυρομιχάλης', 'Ιωάννης Καποδίστριας', 'Αλέξανδρος Μαυροκορδάτος', 'Χαρίλαος Τρικούπης', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-51', 'Ποια περιοχή από τις παρακάτω ΔΕΝ περιλάμβανε η Ελλάδα του 1830; ', 'Την Πελοπόννησο', 'Την Κρήτη', 'Τις Κυκλάδες', 'Τη Στερεά Ελλάδα', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-52', 'Πότε ενώθηκε η Κρήτη με την Ελλάδα; ', '1832', '1900', '1913', '1920', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-53', 'Μετά από ποιους πολέμους γίνονται η Μακεδονία και η  Ήπειρος ελληνικές; ', 'Τους Βαλκανικούς', 'Τον Α΄Παγκόσμιο', 'Τη Μικρασιατική εκστρατεία', 'Τον Β΄ Παγκόσμιο', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-54', 'Ποιος ήταν ο πρώτος βασιλιάς της Ελλάδας;', 'Ο Όθωνας', 'Ο Κωνσταντίνος', 'Ο Γεώργιος Α΄', 'Ο Παύλος', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-55', 'Ποιου πρωθυπουργού ήταν έργο η διάνοιξη της διώρυγας της Κορίνθου;', 'Του Ιωάννη Κωλέττη', 'Του Ιωάννη Καποδίστρια', 'Του Αλέξανδρου Μαυροκορδάτου', 'Του Χαριλάου Τρικούπη', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-56', 'Πότε έγιναν ελληνικά τα νησιά του Βορείου Αιγαίου; ', '1832', '1913', '1922', '1940', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-57', 'Στον ελληνικό Διχασμό ήρθε σε αντιπαράθεση ο  Βενιζέλος με το βασιλιά ... ', 'Όθωνα', 'Κωνσταντίνο', 'Γεώργιο Α\'', 'Παύλο', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-58', 'Πότε ανατέθηκε στην Ελλάδα η διοίκηση της περιοχής της Σμύρνης; ', '1918', '1920', '1922', '1935', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-59', 'Πότε καταστράφηκε η Σμύρνη; ', '1910', '1917', '1922', '1928', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-6', 'Πότε δημιουργήθηκε η πόλη-κράτος; ', 'Τον  12ο αι. π.Χ.', 'Τον  10ο αι. π.Χ.', 'Τον  8ο αι. π.Χ.', 'Τον  7ο αι. π.Χ.', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-60', 'Πότε άρχισε και πότε τελείωσε ο Α΄ Παγκόσμιος πόλεμος; ', '1912-1913', '1914-1918', '1917-1922', '1920-1922', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-61', 'Ποια από τις παρακάτω δυνάμεις ΔΕΝ ήταν μέλος της Αντάντ; ', 'Αγγλία', 'Γαλλία', 'Γερμανία', 'Ρωσία', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-62', 'Στον Α΄Παγκόσμιο πόλεμο η Αντάντ πολέμησε κατά ... ', 'Των Κεντρικών Δυνάμεων', 'Της Οθωμανικής Αυτοκρατορίας', 'Της Γερμανίας', 'Της Γαλλίας', 1, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-63', 'Οι Έλληνες της Μικρασίας ήρθαν στην Ελλάδα μετά ... ', 'Την Ελληνική επανάσταση', 'Τον Α΄ Παγκόσμιο πόλεμο', 'Τη Μικρασιατική καταστροφή', 'Τον Β΄ Παγκόσμιο πόλεμο', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-64', 'Ποιο πολίτευμα ήθελαν οι Έλληνες, σύμφωνα με τα Συντάγματα των εθνοσυνελεύσεων από το 1821 έως το 1827; ', 'Συνταγματική μοναρχία', 'Αβασίλευτη δημοκρατία', 'Βασιλεία', 'Βασιλευομένη δημοκρατία', 2, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-7', 'Ποιοι συγκροτούσαν την οπλιτική φάλαγγα; ', 'Οι ευγενείς', 'Οι δούλοι', 'Οι οπλίτες', 'Μόνο όσοι μπορούσαν να αγοράσουν τον απαραίτητο εξοπλισμό', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-8', 'Ποιο πολίτευμα υπήρξε αμέσως μετά το αριστοκρατικό; ', 'Η βασιλεία', 'Η τυραννία', 'Η ολιγαρχία', 'Η δημοκρατία', 3, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 5, 'ΙΣΤΟΡΙΑ-9', 'Ποια πολιτεύματα υπήρξαν πριν από το δημοκρατικό; ', 'Η αριστοκρατία', 'Η τυραννία', 'Η ολιγαρχία', 'Όλα τα παραπάνω', 4, '2026-08-23 18:32:38', '2026-08-23 18:32:38'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-1', 'Σύμφωνα με το διήγημα της Ειρήνης Μάρρα «Τα κόκκινα λουστρίνια», ο μικρός  βιοπαλαιστής σκέφτηκε πως πρέπει να φτιάξει γοβάκια για  …', 'Τη μητέρα του', 'Την αδερφή του', 'Την κοπέλα που αγαπούσε', 'Καμία από αυτές', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-10', 'Το απόσπασμα «Νέα Παιδαγωγική» από την «Αναφορά στον Γκρέκο» γράφτηκε από τον …   ', 'Α. Παπαδιαμάντη', 'Μ. Καραγάτση', 'Ν. Καζαντζάκη', 'Α. Σαμαράκη', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-11', 'Ποιος έγραψε το «Θούριο»;   ', 'Ο Διονύσιος Σολωμός', 'Ο Ρήγας Φεραίος', 'Ο Αδαμάντιος Κοραής', 'Ο Γιάννης Μακρυγιάννης', 2, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-12', 'Ποιος από τους πρωταγωνιστές του 1821 έμαθε γράμματα, για να γράψει τα απομνημονεύματά του;   ', 'Ο Θεόδωρος Κολοκοτρώνης', 'Ο Ρήγας Φεραίος', 'Ο Γιάννης Μακρυγιάννης', 'Κανείς από τους τρεις', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-13', 'Ο «Θούριος» του Ρήγα Φεραίου είναι ύμνος ...    ', 'Εκκλησιαστικός', 'Επαναστατικός', 'Δοξαστικός', 'Εθνικός', 2, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-14', 'Ο εθνικός μας ποιητής είναι ο ...   ', 'Ρήγας  Φεραίος', 'Διονύσιος  Σολωμός', 'Κωνσταντίνος Καβάφης', 'Οδυσσέας Ελύτης', 2, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-15', '«Ο Απρίλης με τον έρωτα χορεύουν και γελούνε» από τους Ελεύθερους Πολιορκημένους του Δ. Σολωμού. Εδώ έχουμε:   ', 'Ασύνδετο σχήμα', 'Υπερβολή', 'Αντίθεση', 'Προσωποποίηση', 4, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-16', 'Ποιος έγραψε το μυθιστόρημα «Βίος και πολιτεία του Αλέξη Ζορμπά»;', 'Ο Στρατής Μυριβήλης', 'Ο Άγγελος Σικελιανός', 'Ο Νίκος Καζαντζάκης', 'Ο Γιώργος Θεοτοκάς', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-17', 'Ποιος έγραψε το «Άξιον εστί»;   ', 'Ο Γεώργιος Σεφέρης', 'Ο Νίκος Εγγονόπουλος', 'Ο Οδυσσέας Ελύτης', 'Ο Γιάννης Ρίτσος', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-18', 'Το έργο «Ερωτόκριτος» του Β. Κορνάρου είναι:   ', 'Τραγωδία', 'Κρητική φαρσοκωμωδία', 'Έμμετρο μυθιστόρημα', 'Θρησκευτικό δράμα', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-19', 'Το κείμενο του Ερωτόκριτου του Β. Κορνάρου είναι γραμμένο σε ...   ', 'Καθαρεύουσα', 'Κρητικό ιδίωμα', 'Λαϊκή  γλώσσα', 'Δημοτική γλώσσα', 2, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-2', 'Ποιος έγραψε το ποιητικό έργο «Ελεύθεροι Πολιορκημένοι»;   ', 'Ο Λόρδος Μπάυρον', 'Ο Ανδρέας Κάλβος', 'Ο Διονύσιος  Σολωμός', 'Ο Κωστής Παλαμάς', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-20', 'Ο Ρήγας Φεραίος ονομάζεται και ...    ', 'Επτανήσιος', 'Πατρινός', 'Βελεστινλής', 'Κερκυραίος', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-21', 'Το δημοτικό τραγούδι «Του γιοφυριού της Άρτας» ανήκει στην κατηγορία των ...  ', 'Παραλογών', 'Ακριτικών τραγουδιών', 'Κλέφτικων τραγουδιών', 'Ιστορικών τραγουδιών', 1, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-3', 'Οι Ελεύθεροι πολιορκημένοι του ομώνυμου έργου του Διονυσίου  Σολωμού είναι οι …', 'Αθηναίοι', 'Θεσσαλονικείς', 'Μεσολογγίτες', 'Θηβαίοι', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08');
INSERT INTO `questions` (`categoryId`, `subjectId`, `number`, `title`, `answer1`, `answer2`, `answer3`, `answer4`, `correctAnswer`, `createdAt`, `updatedAt`) VALUES
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-4', 'Ποιος έγραψε το ποίημα «Ιθάκη»;   ', 'Ο Κωστής Παλαμάς', 'Ο Άγγελος Σικελιανός', 'Ο Κωνσταντίνος Καβάφης', 'Ο Γιάννης Ρίτσος', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-5', 'Στο παραμύθι «Το πιο γλυκό ψωμί», το ψωμί που έφτιαξε μόνος του ο βασιλιάς ήταν το πιο γλυκό του κόσμου, γιατί ...', 'Ακολούθησε μία γλυκιά συνταγή', 'Είχε γίνει με δικό του κόπο', 'Είχε βάλει πολλή ζάχαρη', 'Είχε βάλει πολύ μέλι', 2, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-6', 'Σύμφωνα με το αφήγημα «Ο παππούς και το εγγονάκι» του Λ. Τολστόι πρέπει να συμπεριφερόμαστε στους ανθρώπους της τρίτης ηλικίας με:   ', 'Σεβασμό', 'Κατανόηση', 'Αγάπη', 'Όλα τα παραπάνω', 4, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-7', 'Το απόσπασμα «Μία Κυριακή στην Κνωσσό» από την «Αναφορά στον Γκρέκο» γράφτηκε από τον … ', 'Βιτσέντζο Κορνάρο', 'Γιάννη Μαγκλή', 'Νίκο Καζαντζάκη', 'Ηλία Βενέζη', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-8', 'Η Άννα Φρανκ, η συγγραφέας του έργου «Το ημερολόγιο της Άννας Φρανκ», ήταν στην καταγωγή:    ', 'Γαλλίδα', 'Γερμανίδα', 'Εβραία', 'Ελληνίδα', 3, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 3, 'ΛΟΓΟΤΕΧΝΙΑ-9', 'Η «Ερωφίλη» είναι γραμμένη από τον ...', 'Βιτσέντζο Κορνάρο', 'Γεώργιο Χορτάτση', 'Μαρίνο Τζάνε Μπουνιαλή', 'Κρητικό λαό', 2, '2026-08-23 18:32:08', '2026-08-23 18:32:08'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-1', 'Ποιο είναι το θέμα της Οδύσσειας;', 'Η επιστροφή του Αχιλλέα', 'Η επιστροφή του Οδυσσέα', 'Η επιβράβευση του Οδυσσέα', 'Η επιστροφή του Αγαμέμνονα', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-10', 'Ο Οδυσσέας, για να φύγει από το νησί της Καλυψώς, φτιάχνει με τη βοήθειά της ... ', 'Ένα κανό', 'Μία βάρκα', 'Μία σχεδία', 'Ένα μεγάλο πλοίο', 3, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-11', 'Ποιος Θεός αποφασίζει να ταλαιπωρήσει τον Οδυσσέα, λίγο πριν φτάσει στο νησί των Φαιάκων;  ', 'Ο Δίας', 'Ο Ποσειδώνας', 'Ο Ερμής', 'Ο Απόλλωνας', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-12', 'Η Ινώ λυπάται τον Οδυσσέα και του δίνει, για να τον σώσει, ...', 'Ένα μαγικό φίλτρο', 'Ένα μαντήλι', 'Ένα χρυσό σταυρό', 'Ένα καράβι', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-13', 'Τον Οδυσσέα βρίσκει πρώτη στην παραλία η κόρη του βασιλιά των Φαιάκων, η …', 'Ελένη', 'Ινώ', 'Καλυψώ', 'Ναυσικά', 4, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-14', 'Πώς λεγόταν ο βασιλιάς των Φαιάκων; ', 'Νέστορας', 'Αγχίαλος', 'Αλκίνοος', 'Μενέλαος', 3, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-15', 'Ποιοι έφεραν με πλοίο τον Οδυσσέα από τη Σχερία στην Ιθάκη;  ', 'Οι Αθηναίοι', 'Οι Ατρείδες', 'Οι Λακεδαιμόνιοι', 'Οι Φαίακες', 4, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-16', 'Ο Οδυσσέας πηγαίνει στο καλύβι του Εύμαιου, αφού πρώτα η Αθηνά τον μεταμορφώνει σε ...  ', 'Ναύτη', 'Ζητιάνο', 'Έμπορο', 'Θεό', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-17', 'Τι κάνει η Πηνελόπη, όταν της αποκαλύπτεται ο Οδυσσέας; ', 'Τον πιστεύει και τρέχει στην αγκαλιά του', 'Ζητάει αποδείξεις, για να πειστεί', 'Δεν τον πιστεύει', 'Τον διώχνει', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-18', 'Ο πρώτος που αναγνωρίζει τον Οδυσσέα, όταν επιστρέφει στο παλάτι μεταμφιεσμένος σε ζητιάνο είναι: ', 'Η σύζυγός του Πηνελόπη', 'Ο σκύλος του Άργος', 'Η παραμάνα του Ευρύκλεια', 'Ο γιος του Τηλέμαχος', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-2', 'Τι ήταν ο Όμηρος; ', 'Αοιδός', 'Ραψωδός', 'Τραγωδός', 'Ιστορικός', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-3', 'Πώς λεγόταν ο αοιδός στο παλάτι του Οδυσσέα;', 'Δημόδοκος', 'Μέντορας', 'Φήμιος', 'Κάλχας', 3, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-4', 'Ο Ποσειδώνας μισεί τον Οδυσσέα, γιατί ...', 'Σκότωσε το γιο του, τον κύκλωπα Πολύφημο', 'Τύφλωσε το γιο του, τον κύκλωπα Πολύφημο', 'Δεν του έκανε θυσίες', 'Για όλα τα παραπάνω', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-5', ' Όταν η Θεά Αθηνά εμφανίζεται στον Τηλέμαχο, παίρνει τη μορφή του ... ', 'Μέντη', 'Νέστορα', 'Μενέλαου', 'Κάλχα', 1, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-6', 'Όταν η Αθηνά έρχεται στην Ιθάκη, βρίσκει τον Τηλέμαχο να ...', 'Διασκεδάζει με τους μνηστήρες', 'Κάθεται μόνος και λυπημένος', 'Μαλώνει με τους μνηστήρες', 'Διώχνει τους μνηστήρες από το παλάτι', 2, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-7', 'Όταν ο Ερμής πηγαίνει στην Καλυψώ, εκείνη τον υποδέχεται και τον φιλοξενεί, όπως ακριβώς κάνουν και οι άνθρωποι. Πώς λέγεται αυτό; ', 'Αναχρονισμός', 'Ανθρωποκεντρισμός', 'Ανθρωπομορφισμός', 'Εγκιβωτισμός', 3, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-8', 'Ο Τηλέμαχος, γυρνώντας από τη Σπάρτη, πηγαίνει στο καλύβι του Εύμαιου του χοιροβοσκού. Ποιον βρίσκει εκεί;', 'Τον Εύμαιο', 'Τους μνηστήρες', 'Τη Θεά Αθηνά', 'Τον Οδυσσέα', 4, '2026-08-23 18:32:52', '2026-08-23 18:32:52'),
(1, 6, 'ΟΔΥΣΣΕΙΑ-9', 'Η Καλυψώ προσπαθώντας να πείσει τον Οδυσσέα να παραμείνει, του υπόσχεται ... ', 'Αθανασία', 'Πολλά χρήματα', 'Ένα πλοίο', 'Να τον κάνει βασιλιά', 1, '2026-08-23 18:32:52', '2026-08-23 18:32:52');

-- --------------------------------------------------------

--
-- Table structure for table `subjects`
--

CREATE TABLE `subjects` (
  `id` int NOT NULL,
  `name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `categoryId` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `subjects`
--

INSERT INTO `subjects` (`id`, `name`, `categoryId`) VALUES
(1, 'ΑΡΧΑΙΑ ΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ', 1),
(2, 'ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ', 1),
(3, 'ΛΟΓΟΤΕΧΝΙΑ ', 1),
(4, 'ΘΡΗΣΚΕΥΤΙΚΑ', 1),
(5, 'ΙΣΤΟΡΙΑ', 1),
(6, 'ΟΔΥΣΣΕΙΑ', 1),
(7, 'ΙΛΙΑΔΑ', 1),
(8, 'ΕΛΕΝΗ', 1),
(9, 'ΜΑΘΗΜΑΤΙΚΑ', 2),
(10, 'ΠΛΗΡΟΦΟΡΙΚΗ', 2),
(11, 'ΤΕΧΝΟΛΟΓΙΑ', 2),
(12, 'ΦΥΣΙΚΗ', 3),
(13, 'ΓΕΩΓΡΑΦΙΑ', 3),
(14, 'ΒΙΟΛΟΓΙΑ', 3),
(15, 'ΧΗΜΕΙΑ', 3),
(16, 'ΓΑΛΛΙΚΑ', 4),
(17, 'ΚΟΙΝΩΝΙΚΗ ΚΑΙ ΠΟΛΙΤΙΚΗ ΑΓΩΓΗ', 4),
(18, 'ΑΓΓΛΙΚΑ', 4),
(19, 'ΓΕΡΜΑΝΙΚΑ', 4),
(20, 'ΟΙΚΙΑΚΗ ΟΙΚΟΝΟΜΙΑ', 5),
(21, 'ΦΥΣΙΚΗ ΑΓΩΓΗ', 5),
(22, 'ΜΟΥΣΙΚΗ', 5),
(23, 'ΚΑΛΛΙΤΕΧΝΙΚΑ', 5),
(101, 'ΔΙΚΤΥΑ ΥΠΟΛΟΓΙΣΤΩΝ', 10);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`number`);

--
-- Indexes for table `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `subjects`
--
ALTER TABLE `subjects`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=102;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
